<a href="https://colab.research.google.com/github/Epvargas/Elyse-Data-Cleaning-Scripts/blob/main/Elyse_Data_Cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning

In [147]:
# Let's load a new dataset on the number of fires in the Amazon rainforest 

import pandas as pd

file_name = "https://raw.githubusercontent.com/Epvargas/Elyse-Data/main/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")

df.tail()

       ano       mes     estado numero  encontro
6449  2012  Dezembro  Tocantins    128  1/1/2012
6450  2013  Dezembro  Tocantins     85  1/1/2013
6451  2014  Dezembro  Tocantins    223  1/1/2014
6452  2015  Dezembro  Tocantins    373  1/1/2015
6453  2016  Dezembro  Tocantins    119  1/1/2016

In [148]:
# How many regions are in the dataset?

df['estado'].unique()

array(['Acre', 'alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

# Renaming Columns

In [149]:
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}

df.rename(columns = new_columns, inplace=True)

In [150]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

In [151]:
# How many years of data do we have?
df['year'].unique()

array([1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
       2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017])

In [152]:
# Let's explore our datetypes, we should expect number_of_types to be an integer or float datatype

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   year             6454 non-null   int64
 1   month            6454 non-null   object
 2   state            6454 non-null   object
 3   number_of_fires  6322 non-null   object
 4   date             6454 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [153]:
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre         0 Fires  1/1/1998
1  1999  Janeiro  Acre         0 Fires  1/1/1999
2  2000  Janeiro  Acre         0 Fires  1/1/2000
3  2001  Janeiro  Acre         0 Fires  1/1/2001
4  2002  Janeiro  Acre         0 Fires  1/1/2002

# Re-arranging columns

In [154]:
# Columns are numbered from 0, left to right
# Let's put date first, month second and year 3rd

new_order = [4,1,0,2,3,]
df = df[df.columns[new_order]]
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre         0 Fires
1  1/1/1999  Janeiro  1999  Acre         0 Fires
2  1/1/2000  Janeiro  2000  Acre         0 Fires
3  1/1/2001  Janeiro  2001  Acre         0 Fires
4  1/1/2002  Janeiro  2002  Acre         0 Fires

In [155]:
df.head(25)

        date      month  year state number_of_fires
0   1/1/1998    Janeiro  1998  Acre         0 Fires
1   1/1/1999    Janeiro  1999  Acre         0 Fires
2   1/1/2000    Janeiro  2000  Acre         0 Fires
3   1/1/2001    Janeiro  2001  Acre         0 Fires
4   1/1/2002    Janeiro  2002  Acre         0 Fires
5   1/1/2003    Janeiro  2003  Acre        10 Fires
6   1/1/2004    Janeiro  2004  Acre         0 Fires
7   1/1/2005    Janeiro  2005  Acre        12 Fires
8   1/1/2006    Janeiro  2006  Acre         4 Fires
9   1/1/2007    Janeiro  2007  Acre         0 Fires
10  1/1/2008    Janeiro  2008  Acre         0 Fires
11  1/1/2009    Janeiro  2009  Acre         0 Fires
12  1/1/2010    Janeiro  2010  Acre         1 Fires
13  1/1/2011    Janeiro  2011  Acre         0 Fires
14  1/1/2012    Janeiro  2012  Acre         0 Fires
15  1/1/2013    Janeiro  2013  Acre         0 Fires
16  1/1/2014    Janeiro  2014  Acre         0 Fires
17  1/1/2015    Janeiro  2015  Acre         1 Fires
18  1/1/2016    Janeiro  2016  Acre        12 Fires
19  1/1/2017    Janeiro  2017  Acre         0 Fires
20  1/1/1998  Fevereiro  1998  Acre         0 Fires
21  1/1/1999  Fevereiro  1999  Acre         0 Fires
22  1/1/2000  Fevereiro  2000  Acre         0 Fires
23  1/1/2001  Fevereiro  2001  Acre         0 Fires
24  1/1/2002  Fevereiro  2002  Acre         1 Fires

In [156]:
df.tail()

          date     month  year      state number_of_fires
6449  1/1/2012  Dezembro  2012  Tocantins             128
6450  1/1/2013  Dezembro  2013  Tocantins              85
6451  1/1/2014  Dezembro  2014  Tocantins             223
6452  1/1/2015  Dezembro  2015  Tocantins             373
6453  1/1/2016  Dezembro  2016  Tocantins             119

# Determing if a column contains numeric data

In [157]:
# It isn't, let's find our why

df['number_of_fires'].str.isnumeric()

0       False
1       False
2       False
3       False
4       False
        ...
6449     True
6450     True
6451     True
6452     True
6453     True
Name: number_of_fires, Length: 6454, dtype: object

In [158]:
#df[df['number_of_fires'].str.isdigit()]

In [159]:
# We get the above error because our isdigit() returns Nan for blank or missing values
# To fix this we need to convert our column datatype from non-null objects to a String

#df['number_of_fires'].astype(str).str.isdigit()


- Bascially, `str.isdigit` only returns True for strings containing solely the digits 0-9. 
- By contrast, `str.isnumeric` returns True if it contains any numeric characters. e.g. '½'

# Removing unnecessary text from columns

In [160]:
df['number_of_fires'].str.strip("Fires")

0        0
1        0
2        0
3        0
4        0
       ...
6449    128
6450     85
6451    223
6452    373
6453    119
Name: number_of_fires, Length: 6454, dtype: object

Strip - Return a copy of the string with leading and trailing characters removed. If chars is omitted or None, whitespace characters are removed. If given and not None, chars must be a string; the characters in the string will be stripped from the both ends of the string this method is called on.

In [161]:
# To replace column with cleaned column

df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df.head()

       date    month  year state number_of_fires
0  1/1/1998  Janeiro  1998  Acre               0
1  1/1/1999  Janeiro  1999  Acre               0
2  1/1/2000  Janeiro  2000  Acre               0
3  1/1/2001  Janeiro  2001  Acre               0
4  1/1/2002  Janeiro  2002  Acre               0

In [162]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             6454 non-null   object
 1   month            6454 non-null   object
 2   year             6454 non-null   int64
 3   state            6454 non-null   object
 4   number_of_fires  6322 non-null   object
dtypes: int64(1), object(4)
memory usage: 252.2+ KB

In [163]:
# We need to convert our number_of_fires column to a float data type
# Also, here's an alternative string manipulation technique we can use

df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)
df.head()

       date    month  year state  number_of_fires
0  1/1/1998  Janeiro  1998  Acre              0.0
1  1/1/1999  Janeiro  1999  Acre              0.0
2  1/1/2000  Janeiro  2000  Acre              0.0
3  1/1/2001  Janeiro  2001  Acre              0.0
4  1/1/2002  Janeiro  2002  Acre              0.0

In [164]:
# That was one way we could have handled blank data

# Handling missing data

In [165]:
file_name = "https://raw.githubusercontent.com/Epvargas/Elyse-Data/main/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
# Creating a true copy of our dataframe
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [166]:
# Viewing the sum of missing values in each column

df.isnull().sum()

year                 0
month                0
state                0
number_of_fires    132
date                 0
dtype: int64

In [167]:
# We can easily remove Null or NaN (not a number) values 

# Drop rows with NaN values
df = df.dropna() 
df = df.reset_index() # reset's row indexes in case any rows were dropped
df.head()

   index  year    month state number_of_fires      date
0      0  1998  Janeiro  Acre               0  1/1/1998
1      1  1999  Janeiro  Acre               0  1/1/1999
2      2  2000  Janeiro  Acre               0  1/1/2000
3      3  2001  Janeiro  Acre               0  1/1/2001
4      4  2002  Janeiro  Acre               0  1/1/2002

In [168]:
# Let's check and see it worked

df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

In [193]:
# Alright so it worked, now let's reload the data and look at a few other methods of dealing with NaN or Null values

new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
6      7  Janeiro  Acre              12
7      8  Janeiro  Acre               4
8      9  Janeiro  Acre               0
9     10  Janeiro  Acre               0

In [170]:
# Create a boolean index for all null values

df['number_of_fires'].isnull()

0       False
1       False
2       False
3       False
4       False
        ...
6317    False
6318    False
6319    False
6320    False
6321    False
Name: number_of_fires, Length: 6322, dtype: bool

In [171]:
df[df['number_of_fires'].isnull()].head(10)

Empty DataFrame
Columns: [index, year, month, state, number_of_fires, date]
Index: []

# What do to with missing data?

* Remove them via .dropna(axis=0)
* Replace them with some arbitary number (e.g. an average)
* Replace them zeros, or Forward Fill (ffill) or Back Fill (backfill)

In [172]:
# Using fillna with zeros

df['number_of_fires'].fillna(0).head()

0    0
1    0
2    0
3    0
4    0
Name: number_of_fires, dtype: object

In [173]:
# Let's try back filling
df['number_of_fires'].fillna(method='ffill').head(70)

0     0
1     0
2     0
3     0
4     0
     ..
65    1
66    2
67    1
68    0
69    0
Name: number_of_fires, Length: 70, dtype: object

In [174]:
# View index 444 to see how it changes
# Homework, change 444 using ffill and backfill to see how it changes
df.iloc[444]

index                   450
year                   2008
month              Novembro
state               alagoas
number_of_fires          37
date               1/1/2008
Name: 444, dtype: object

In [175]:
df.iloc[445]

index                   451
year                   2009
month              Novembro
state               alagoas
number_of_fires          55
date               1/1/2009
Name: 445, dtype: object

In [176]:
# let's make the assumption that blank values are 0 fires

# let's get back our copy of our original pre-processed datafrmae
df = df_copy

# replace all missing or NaN values with 0
df['number_of_fires'] = df['number_of_fires'].fillna(0)

In [177]:
# Let's check to see if we did change our Nans to 0s
df.iloc[444]

index                   450
year                   2008
month              Novembro
state               alagoas
number_of_fires          37
date               1/1/2008
Name: 444, dtype: object

# Assigning data types to our columns

In [178]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6322 entries, 0 to 6321
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            6322 non-null   int64
 1   year             6322 non-null   int64
 2   month            6322 non-null   object
 3   state            6322 non-null   object
 4   number_of_fires  6322 non-null   object
 5   date             6322 non-null   object
dtypes: int64(2), object(4)
memory usage: 296.5+ KB

In [179]:
df["number_of_fires"] = df["number_of_fires"].str.replace('','0').astype(float)

In [180]:
df.head()

   index  year    month state  number_of_fires      date
0      0  1998  Janeiro  Acre              0.0  1/1/1998
1      1  1999  Janeiro  Acre              0.0  1/1/1999
2      2  2000  Janeiro  Acre              0.0  1/1/2000
3      3  2001  Janeiro  Acre              0.0  1/1/2001
4      4  2002  Janeiro  Acre              0.0  1/1/2002

In [181]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6322 entries, 0 to 6321
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            6322 non-null   int64
 1   year             6322 non-null   int64
 2   month            6322 non-null   object
 3   state            6322 non-null   object
 4   number_of_fires  6322 non-null   float64
 5   date             6322 non-null   object
dtypes: float64(1), int64(2), object(3)
memory usage: 296.5+ KB

In [182]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Março', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)

# Replacing text in columns

In [183]:
# Let's convert our Portuguese month names to English

month_translations = {'Janeiro': 'January',
'Fevereiro': 'February',
'Março': 'March',
'Abril': 'April',
'Maio': 'May',
'Junho': 'June',
'Julho': 'July',
'Agosto': 'August',
'Setembro': 'September',
'Outubro': 'October',
'Novembro': 'November',
'Dezembro': 'December'}

df["month"] = df["month"].map(month_translations)
df.head()

   index  year    month state  number_of_fires      date
0      0  1998  January  Acre              0.0  1/1/1998
1      1  1999  January  Acre              0.0  1/1/1999
2      2  2000  January  Acre              0.0  1/1/2000
3      3  2001  January  Acre              0.0  1/1/2001
4      4  2002  January  Acre              0.0  1/1/2002

In [184]:
df.isnull().sum()

index              0
year               0
month              0
state              0
number_of_fires    0
date               0
dtype: int64

# Further string functions on columns

In [185]:
df['state'] = df['state'].str.title()
df['state'].unique()

array(['Acre', 'Alagoas', 'Amapa', 'Amazonas', 'Bahia', 'Ceara',
       'Distrito Federal', 'Espirito Santo', 'Goias', 'Maranhao',
       'Mato Grosso', 'Minas Gerais', 'Pará', 'Paraiba', 'Pernambuco',
       'Piau', 'Rio', 'Rondonia', 'Roraima', 'Santa Catarina',
       'Sao Paulo', 'Sergipe', 'Tocantins'], dtype=object)

# Removing columns

In [186]:
df.head()

   index  year    month state  number_of_fires      date
0      0  1998  January  Acre              0.0  1/1/1998
1      1  1999  January  Acre              0.0  1/1/1999
2      2  2000  January  Acre              0.0  1/1/2000
3      3  2001  January  Acre              0.0  1/1/2001
4      4  2002  January  Acre              0.0  1/1/2002

In [187]:
# Dropping multiple columns
df = df.drop("date", axis=1) # axis = 1 so that it works across our columns
df.head()

   index  year    month state  number_of_fires
0      0  1998  January  Acre              0.0
1      1  1999  January  Acre              0.0
2      2  2000  January  Acre              0.0
3      3  2001  January  Acre              0.0
4      4  2002  January  Acre              0.0

In [194]:
# Let's reload the data
file_name = "https://raw.githubusercontent.com/Epvargas/Elyse-Data/main/amazon_fires.csv"
df = pd.read_csv(file_name, encoding = "ISO-8859-1")
new_columns = {'ano' : 'year',
               'estado': 'state',
               'mes': 'month',
               'numero': 'number_of_fires',
               'encontro': 'date'}
df.rename(columns = new_columns, inplace=True)
df['number_of_fires'] = df['number_of_fires'].str.strip(" Fires")
df_copy = df.copy()
df.head()

   year    month state number_of_fires      date
0  1998  Janeiro  Acre               0  1/1/1998
1  1999  Janeiro  Acre               0  1/1/1999
2  2000  Janeiro  Acre               0  1/1/2000
3  2001  Janeiro  Acre               0  1/1/2001
4  2002  Janeiro  Acre               0  1/1/2002

In [189]:
# Drop multiple columns 
df = df.drop(["year", "date"], axis=1)
df.head()

     month state number_of_fires
0  Janeiro  Acre               0
1  Janeiro  Acre               0
2  Janeiro  Acre               0
3  Janeiro  Acre               0
4  Janeiro  Acre               0

# Dropping Rows

Using the df.index function

In [190]:
# Let's drop the first row 
df = df.drop(df.index[0])
df = df.reset_index()
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
2      3  Janeiro  Acre               0
3      4  Janeiro  Acre               0
4      5  Janeiro  Acre              10

In [191]:
# Drop multiple rows

df = df.drop(df.index[[2,3]])
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
1      2  Janeiro  Acre               0
4      5  Janeiro  Acre              10
5      6  Janeiro  Acre               0
6      7  Janeiro  Acre              12

In [192]:
# Drop a range of rows

df = df.drop(df.index[1:4])
df.head()

   index    month state number_of_fires
0      1  Janeiro  Acre               0
6      7  Janeiro  Acre              12
7      8  Janeiro  Acre               4
8      9  Janeiro  Acre               0
9     10  Janeiro  Acre               0